from telethon import events

def register(client, config, data_path):
    @client.on(events.NewMessage(pattern=r'^\.منو$'))
    async def show_menu(event):
        text = """
**درود عزیزم، برای استفاده از سلف بات 𝐃𝐀𝐑𝐊 از دستورات زیر استفاده کن😉♥️**

📍 قفل پیوی:
`.فعال سازی قفل پیوی`
`.غیرفعال سازی قفل پیوی`

📍 هشدار کلمه خاص:
`.تنظیم کلمه [متن]`
`.فعال سازی هشدار کلمه`
`.غیرفعال سازی هشدار کلمه`

📍 ری‌اکشن خودکار:
`.فعال سازی ری اکشن خودکار`
`.تنظیم ایموجی های ری اکشن خودکار 😂 🔥 😎`
`.غیرفعال سازی ری اکشن خودکار`

📍 اکشن ها:
`.اکشن تایپ`
`.اکشن ویس`
`.اکشن ویدیو`
`.اکشن عکس`
`.اکشن فایل`
`.اکشن بازی`
`.اکشن خاموش`

📍 ساعت زنده:
`.فعال سازی ساعت اسم`
`.غیرفعال سازی ساعت اسم`
`.فعال سازی ساعت بیو`
`.غیرفعال سازی ساعت بیو`

📍 تبچی امن:
`.افزودن گروه تبچی`
`.حذف گروه تبچی`
`.تنظیم پیام تبچی [متن]`
`.تنظیم فاصله تبچی [دقیقه]`
`.افزودن پیوی تبچی`
`.حذف پیوی تبچی`
`.فعال سازی تبچی`
`.غیرفعال سازی تبچی`

📍 فرمت‌دهی خودکار پیام:
`.فرمت بولد`
`.فرمت کج`
`.فرمت زیرخط‌دار`
`.فرمت خط‌خورده`
`.فرمت اسپویلر`
`.فرمت نقل قول`
`.فرمت کد`
`.فرمت پری`
`.فرمت معمولی`

📍 پروفایل و عکس:
`.فعال سازی چرخش عکس`
`.افزودن عکس پروفایل`
`.تنظیم فاصله چرخش عکس [عدد]`

📍 مدیریت وضعیت:
`.فعال سازی آنلاین`
`.غیرفعال سازی آنلاین`

📍 دوست و دشمن:
`.دشمن`
`.افزودن پیام فش`
`.لیست پیام فش`
`.لیست دشمن ها`
`.حذف دشمن`
~~~~
`.دوست`
`.افزودن پیام دوست`
`.لیست پیام دوست`
`.لیست دوست ها`
`.حذف دوست`

📍 بازکننده استارزی:
`.بازشو`

📍 تگ همه:
`.تگ همه`
`.لغو تگ`

📍 ماشین حساب:
`.حساب (2 + 5) * 3`

📍 فال روزانه:
`.فال`

📍 اطلاعات:
`.اطلاعات`

📍 منو:
`.منو`
"""
        await event.reply(text)
        